## Basic Stats for Visualizations with Dataset2

In [1]:
# import dependencies
import pandas as pd
import numpy as np

In [2]:
# import clean csv to df
salary_df2 = pd.read_csv("salary_data2.csv")
salary_df2.head()

,Unnamed: 0,age,gender,country,education,title,size,data_prof_size,mach_learn_presence,salary,...,sql_lite,sqlserver,oracle,micro_acess,aws_data,aws_dynamo,azure_sql,google_sql,database_none,database_other
0,0,23.0,Male,France,Master’s degree,Software Engineer,medium,0,I do not know,34999.5,...,0,0,0,0,0,0,0,0,0,0
1,1,42.0,Male,India,Professional degree,Software Engineer,large,20+,"We have well established ML methods (i.e., mod...",6249.5,...,0,0,0,0,0,0,0,0,0,0
2,2,42.0,Male,Australia,Master’s degree,Other,large,20+,I do not know,274999.5,...,0,0,0,0,0,0,1,0,0,0
3,3,23.0,Male,India,Bachelor’s degree,Other,small,0,No (we do not use ML methods),4499.5,...,0,0,0,0,0,0,0,0,0,0
4,4,52.0,Male,France,Master’s degree,Data Scientist,small,4-Mar,"We have well established ML methods (i.e., mod...",64999.5,...,0,0,0,0,1,0,0,0,0,0

In [3]:
# load region data
country_to_region_df = pd.read_csv("country_to_region.csv")
country_to_region_df= country_to_region_df.set_axis(["country", "region"], 
                                axis='columns', inplace=False)
country_to_region_df.head()

     country          region
0     Canada   North America
1     Russia  Eastern Europe
2  Indonesia            Asia
3  Argentina   Latin America
4   Colombia   Latin America

### Merged dataset with the countries region

In [4]:
# merge the two dfs together
merged_df = pd.merge(salary_df2, country_to_region_df, on="country", how="inner")
merged_df.head()

,Unnamed: 0,age,gender,country,education,title,size,data_prof_size,mach_learn_presence,salary,...,sqlserver,oracle,micro_acess,aws_data,aws_dynamo,azure_sql,google_sql,database_none,database_other,region
0,0,23.0,Male,France,Master’s degree,Software Engineer,medium,0,I do not know,34999.5,...,0,0,0,0,0,0,0,0,0,Western Europe
1,4,52.0,Male,France,Master’s degree,Data Scientist,small,4-Mar,"We have well established ML methods (i.e., mod...",64999.5,...,0,0,0,1,0,0,0,0,0,Western Europe
2,13,37.0,Male,France,Master’s degree,Product/Project Manager,large,20+,"We recently started using ML methods (i.e., mo...",499.5,...,0,1,0,0,0,1,0,0,0,Western Europe
3,14,27.0,Male,France,Doctoral degree,Research Scientist,small,4-Mar,"We have well established ML methods (i.e., mod...",44999.5,...,0,0,0,0,0,0,0,0,0,Western Europe
4,32,37.0,Male,France,Master’s degree,Data Engineer,large,4-Mar,"We recently started using ML methods (i.e., mo...",44999.5,...,0,0,0,0,0,0,0,0,0,Western Europe

In [5]:
# check how many regions there are
merged_df['region'].value_counts()

Asia              3223
Western Europe    1788
Latin America      896
Eastern Europe     892
Middle East        410
North America      301
Australia          247
Africa             152
South America       51
Name: region, dtype: int64

In [6]:
# job title total 
title_count = salary_df2["title"].value_counts()
title_count

Data Scientist             3640
Software Engineer          2390
Other                      1476
Data Analyst               1417
Research Scientist         1272
Business Analyst            682
Product/Project Manager     667
Data Engineer               551
Statistician                263
DBA/Database Engineer       139
Name: title, dtype: int64

## Languages Stats based on the whole datset

In [7]:
# total language counts
python_count = salary_df2["python"].value_counts()
r_count = salary_df2["r"].value_counts()
sql_count = salary_df2["sql"].value_counts()
c_count = salary_df2["c"].value_counts()
cplusplus_count = salary_df2["c++"].value_counts()
java_count = salary_df2["java"].value_counts()
javascript_count = salary_df2["javascript"].value_counts()
typescript_count = salary_df2["typescript"].value_counts()
bash_count = salary_df2["bash"].value_counts()
matlab_count = salary_df2["lan_matlab"].value_counts()
lannone_count = salary_df2["lan_none"].value_counts()
lanother_count = salary_df2["lan_other"].value_counts()

In [8]:
overall_lan_counts = pd.concat([python_count, r_count, sql_count, c_count, cplusplus_count, java_count, javascript_count,
                typescript_count, bash_count, matlab_count, lannone_count, lanother_count ], axis= 1)
overall_lan_counts

,python,r,sql,c,c++,java,javascript,typescript,bash,lan_matlab,lan_none,lan_other
0,3134,8845,7069,11548,11141,10899,10777,12144,10734,11535,12428,11481
1,9363,3652,5428,949,1356,1598,1720,353,1763,962,69,1016

In [9]:
overall_lan_counts = overall_lan_counts.transpose()
overall_lan_counts.head()

            0     1
python   3134  9363
r        8845  3652
sql      7069  5428
c       11548   949
c++     11141  1356

In [10]:
total_per = ((overall_lan_counts[1]/(overall_lan_counts[0]+overall_lan_counts[1]))*100).round(2)
total_per.head()

python    74.92
r         29.22
sql       43.43
c          7.59
c++       10.85
dtype: float64

In [11]:
overall_lan_counts['percentage to of total'] = total_per

In [12]:
overall_lan_counts = overall_lan_counts.set_axis(['does not use','use','% of total used'], axis='columns', inplace=False)
overall_lan_counts.head()

        does not use   use  % of total used
python          3134  9363            74.92
r               8845  3652            29.22
sql             7069  5428            43.43
c              11548   949             7.59
c++            11141  1356            10.85

In [13]:
# overall_lan_counts.to_csv("lan_world.csv", index=True)

## Tools Counts for the world

In [14]:
ggplot = salary_df2["ggplot"].value_counts()
matplotlib = salary_df2["matplotlib"].value_counts()
altair = salary_df2["altair"].value_counts()
shiny = salary_df2["shiny"].value_counts()
d3 = salary_df2["d3"].value_counts()
plotly = salary_df2["plotly"].value_counts()
bokeh = salary_df2["bokeh"].value_counts()
seaborn = salary_df2["seaborn"].value_counts()
geoplotlib = salary_df2["geoplotlib"].value_counts()
leaflet = salary_df2["leaflet"].value_counts()
visnone = salary_df2["vis_none"].value_counts()
visother = salary_df2["vis_other"].value_counts()

In [25]:
overall_tool_counts = pd.concat([
ggplot,
matplotlib,
altair,
shiny,
d3,
plotly,
bokeh,
seaborn,
geoplotlib,
leaflet,
visnone,
visother,
    
], axis= 1)
overall_tool_counts

,ggplot,matplotlib,altair,shiny,d3,plotly,bokeh,seaborn,geoplotlib,leaflet,vis_none,vis_other
0,9223,4990,12356,11387,11547,9931,11627,7520,12010,12024,11530,12110
1,3274,7507,141,1110,950,2566,870,4977,487,473,967,387

In [26]:
overall_tool_counts = overall_tool_counts.transpose()
overall_tool_counts.head()

                0     1
ggplot       9223  3274
matplotlib   4990  7507
altair      12356   141
shiny       11387  1110
d3          11547   950

In [27]:
total_per_tool = ((overall_tool_counts[1]/(overall_tool_counts[0]+overall_tool_counts[1]))*100).round(2)
total_per_tool.head()

ggplot        26.20
matplotlib    60.07
altair         1.13
shiny          8.88
d3             7.60
dtype: float64

In [28]:
overall_tool_counts['percentage total'] = total_per_tool

In [29]:
overall_tool_counts = overall_tool_counts.set_axis(['does not use','use','% of total used'], axis='columns', inplace=False)
overall_tool_counts.head()

            does not use   use  % of total used
ggplot              9223  3274            26.20
matplotlib          4990  7507            60.07
altair             12356   141             1.13
shiny              11387  1110             8.88
d3                 11547   950             7.60

In [30]:
# overall_tool_counts.to_csv("tools_world.csv", index=True)

## Machine Learning Models

In [31]:
regression = salary_df2["regression"].value_counts()
trees_forests = salary_df2["tree_forest"].value_counts()
gradient_boost = salary_df2["gradient_boost"].value_counts()
bayesian = salary_df2["bayesian"].value_counts()
evolutionary = salary_df2["evolutionary"].value_counts()
dnn = salary_df2["dnn"].value_counts()
cnn = salary_df2["cnn"].value_counts()
gan = salary_df2["gan"].value_counts()
rnn = salary_df2["rnn"].value_counts()
bert = salary_df2["bert"].value_counts()
machnone = salary_df2["mach_none"].value_counts()
machother = salary_df2["mach_other"].value_counts()

In [32]:
overall_mach_counts = pd.concat([
regression,
trees_forests,
gradient_boost,
bayesian,
evolutionary,
dnn,
cnn,
gan,
rnn,
bert,
machnone,
machother,
    
], axis= 1)
overall_mach_counts

,regression,tree_forest,gradient_boost,bayesian,evolutionary,dnn,cnn,gan,rnn,bert,mach_none,mach_other
0,4854,5973,8070,9631,11797,10047,8566,11769,9899,11756,11647,12158
1,7643,6524,4427,2866,700,2450,3931,728,2598,741,850,339

In [33]:
overall_mach_counts = overall_mach_counts.transpose()
overall_mach_counts.head()

                    0     1
regression       4854  7643
tree_forest      5973  6524
gradient_boost   8070  4427
bayesian         9631  2866
evolutionary    11797   700

In [34]:
total_mach_tool = ((overall_mach_counts[1]/(overall_mach_counts[0]+overall_mach_counts[1]))*100).round(2)
total_mach_tool.head()

regression        61.16
tree_forest       52.20
gradient_boost    35.42
bayesian          22.93
evolutionary       5.60
dtype: float64

In [36]:
overall_mach_counts['percentage total'] = total_mach_tool

In [37]:
overall_mach_counts = overall_mach_counts.set_axis(['does not use','use','% of total used'], axis='columns', inplace=False)
overall_mach_counts.head()

                does not use   use  % of total used
regression              4854  7643            61.16
tree_forest             5973  6524            52.20
gradient_boost          8070  4427            35.42
bayesian                9631  2866            22.93
evolutionary           11797   700             5.60

In [38]:
# overall_mach_counts.to_csv("mach_world.csv", index=True)

## Looking at basic info based on region

In [ ]:
# look at salary ranges
region = merged_df.groupby("region")
region_salary = pd.DataFrame(region["salary"].mean()).rename(columns={"salary":"avg salary"}).round(0)
region_salary.head()

In [ ]:
# job title based on region
region_title = pd.DataFrame(region["title"].value_counts()).rename(columns={"title":"title counts"})
region_title.head()

In [ ]:
# look at gender stats
region_gender = pd.DataFrame(region["gender"].value_counts()).rename(columns={"gender":"gender counts"})
region_gender.head()

In [ ]:
# look at education counts
region_education = pd.DataFrame(region["education"].value_counts()).rename(columns={"education":"level of education"})
region_education.head()

## Languages knowledge based on region

In [ ]:
# language value counts by region
region_python_count = region["python"].value_counts()
region_r_count = region["r"].value_counts()
region_sql_count = region["sql"].value_counts()
region_c_count = region["c"].value_counts()
region_cplusplus_count = region["c++"].value_counts()
region_java_count = region["java"].value_counts()
region_javascript_count = region["javascript"].value_counts()
region_typescript_count = region["typescript"].value_counts()
region_bash_count = region["bash"].value_counts()
region_matlab_count = region["lan_matlab"].value_counts()
region_lannone_count = region["lan_none"].value_counts()
region_lanother_count = region["lan_other"].value_counts()

In [ ]:
# merge all the columns for the region data
overall_lan_region_counts = pd.concat([region_python_count, region_r_count, region_sql_count, region_c_count, 
                                       region_cplusplus_count, region_java_count, region_javascript_count,
                region_typescript_count, region_bash_count,region_matlab_count, region_lannone_count, region_lanother_count ], axis= 1)
overall_lan_region_counts.head()

In [ ]:
# transpose the datset 
overall_lan_region_counts = overall_lan_region_counts.transpose()
overall_lan_region_counts.head()

In [ ]:
# rename the region columns
overall_lan_region_counts.columns = ['africa_1','africa_2',
                                     'asia_1','asia_2',
                                     'aus_1','aus_2',
                                     'ee_1','ee_2',
                                     'la_1','la_2',
                                     'me_1','me_2',
                                     'na_1','na_2',
                                     'sa_1','sa_2',
                                     'we_1','we_2']
overall_lan_region_counts.head()

In [ ]:
# percantage by region calculation test
total_per_af = ((overall_lan_region_counts['africa_2']/(overall_lan_region_counts['africa_1']
                                                            +overall_lan_region_counts['africa_2']))*100).round(2)
total_per_af.head()

In [ ]:
# percantage by region for remaining regions
total_per_asia = ((overall_lan_region_counts['asia_2']/(overall_lan_region_counts['asia_1']
                                                               +overall_lan_region_counts['asia_2']))*100).round(2)

total_per_aus = ((overall_lan_region_counts['aus_2']/(overall_lan_region_counts['aus_1']
                                                               +overall_lan_region_counts['aus_2']))*100).round(2)

total_per_ee = ((overall_lan_region_counts['ee_2']/(overall_lan_region_counts['ee_1']
                                                               +overall_lan_region_counts['ee_2']))*100).round(2)

total_per_la = ((overall_lan_region_counts['la_2']/(overall_lan_region_counts['la_1']
                                                               +overall_lan_region_counts['la_2']))*100).round(2)

total_per_me = ((overall_lan_region_counts['me_2']/(overall_lan_region_counts['me_1']
                                                               +overall_lan_region_counts['me_2']))*100).round(2)

total_per_na = ((overall_lan_region_counts['na_2']/(overall_lan_region_counts['na_1']
                                                               +overall_lan_region_counts['na_2']))*100).round(2)

total_per_sa = ((overall_lan_region_counts['sa_2']/(overall_lan_region_counts['sa_1']
                                                               +overall_lan_region_counts['sa_2']))*100).round(2)

total_per_we = ((overall_lan_region_counts['we_2']/(overall_lan_region_counts['we_1']
                                                               +overall_lan_region_counts['we_2']))*100).round(2)

In [ ]:
# merging the percentages into a df
region_perc = pd.concat([total_per_af, total_per_asia,total_per_aus,total_per_ee,total_per_la,total_per_me,total_per_na,
                        total_per_sa,total_per_we], axis= 1)
region_perc.head()

### Final percentages of language per total column

In [ ]:
# remaining the column types
region_perc = region_perc.set_axis(['africa', 'asia', 'aus', 'ee', 'la', 'me', 'na', 'sa', 'we'], axis='columns', inplace=False)
region_perc.head()

## Tools Stats per region

In [ ]:
# stats on tools used 
region_jupyter_count = region["jupyter"].value_counts()
region_rstudio_count = region["rstudio"].value_counts()
region_pycharm_count = region["pycharm"].value_counts()
region_atom_count = region["atom"].value_counts()
region_matlab_count = region["matlab"].value_counts()
region_vsc_count = region["vsc"].value_counts()
region_spyder_count = region["spyder"].value_counts()
region_vim_emacs_count = region["vim_emacs"].value_counts()
region_notepadplus_count = region["notepad++"].value_counts()
region_sublime_count = region["sublime"].value_counts()
region_envnone_count = region["env_none"].value_counts()
region_envother_count = region["env_other"].value_counts()

In [ ]:
# making a df from above stats 
overall_tools_region_counts = pd.concat([
region_jupyter_count,
region_rstudio_count, 
region_pycharm_count, 
region_atom_count,
region_matlab_count,
region_vsc_count,
region_spyder_count,
region_vim_emacs_count,
region_notepadplus_count,
region_sublime_count,
region_envnone_count,
region_envother_count, ], axis= 1)
overall_tools_region_counts.head()

In [ ]:
# transposing the data above 
overall_tools_region_counts = overall_tools_region_counts.transpose()
overall_tools_region_counts.head()

In [ ]:
# renaming the columns 
overall_tools_region_counts.columns = ['africa_1','africa_2',
                                     'asia_1','asia_2',
                                     'aus_1','aus_2',
                                     'ee_1','ee_2',
                                     'la_1','la_2',
                                     'me_1','me_2',
                                     'na_1','na_2',
                                     'sa_1','sa_2',
                                     'we_1','we_2']
overall_tools_region_counts.head()

In [ ]:
# perctange of tools used per region
total_per_tools_af = ((overall_tools_region_counts['africa_2']/(overall_tools_region_counts['africa_1']
                                                               +overall_tools_region_counts['africa_2']))*100).round(2)
total_per_tools_af.head()

In [ ]:
# remaining percantages for the other regions
total_per_tools_asia = ((overall_tools_region_counts['asia_2']/(overall_tools_region_counts['asia_1']
                                                               +overall_tools_region_counts['asia_2']))*100).round(2)

total_per_tools_aus = ((overall_tools_region_counts['aus_2']/(overall_tools_region_counts['aus_1']
                                                               +overall_tools_region_counts['aus_2']))*100).round(2)

total_per_tools_ee = ((overall_tools_region_counts['ee_2']/(overall_tools_region_counts['ee_1']
                                                               +overall_tools_region_counts['ee_2']))*100).round(2)

total_per_tools_la = ((overall_tools_region_counts['la_2']/(overall_tools_region_counts['la_1']
                                                               +overall_tools_region_counts['la_2']))*100).round(2)

total_per_tools_me = ((overall_tools_region_counts['me_2']/(overall_tools_region_counts['me_1']
                                                               +overall_tools_region_counts['me_2']))*100).round(2)

total_per_tools_na = ((overall_tools_region_counts['na_2']/(overall_tools_region_counts['na_1']
                                                               +overall_tools_region_counts['na_2']))*100).round(2)

total_per_tools_sa = ((overall_tools_region_counts['sa_2']/(overall_tools_region_counts['sa_1']
                                                               +overall_tools_region_counts['sa_2']))*100).round(2)

total_per_tools_we = ((overall_tools_region_counts['we_2']/(overall_tools_region_counts['we_1']
                                                               +overall_tools_region_counts['we_2']))*100).round(2)

In [ ]:
# making a df for the percentages of tools used 
region_tools_perc = pd.concat([total_per_tools_af, total_per_tools_asia,total_per_tools_aus,total_per_tools_ee,total_per_tools_la,
                         total_per_tools_me,total_per_tools_na,
                        total_per_tools_sa,total_per_tools_we], axis= 1)
region_tools_perc.head()

### Final percantages based on tools popularity

In [ ]:
# renaming the columns above 
region_tools_perc = region_tools_perc.set_axis(['africa', 'asia', 'aus', 'ee', 'la', 'me', 'na', 'sa', 'we'], axis='columns', inplace=False)
region_tools_perc.head()

## Database popularity based on region

In [ ]:
# stats on database used 
region_mysql_count = region["mysql"].value_counts()
region_postgres_count = region["postgres"].value_counts()
region_sqllite_count = region["sql_lite"].value_counts()
region_sqlsever_count = region["sqlserver"].value_counts()
region_oracle_count = region["oracle"].value_counts()
region_microacess_count = region["micro_acess"].value_counts()
region_awsdata_count = region["aws_data"].value_counts()
region_awsdynamo_emacs_count = region["aws_dynamo"].value_counts()
region_azuresql_count = region["azure_sql"].value_counts()
region_googlesql_count = region["google_sql"].value_counts()
region_databasenone_count = region["database_none"].value_counts()
region_databaseother_count = region["database_other"].value_counts()

In [ ]:
# making a df from above stats 
database_region_counts = pd.concat([
region_mysql_count,
region_postgres_count,
region_sqllite_count,
region_sqlsever_count,
region_oracle_count,
region_microacess_count,
region_awsdata_count,
region_awsdynamo_emacs_count,
region_azuresql_count,
region_googlesql_count,
region_databasenone_count,
region_databaseother_count,
], axis= 1)
database_region_counts.head()

In [ ]:
# transposing above df
database_region_counts = database_region_counts.transpose()
database_region_counts.head()

In [ ]:
# renaming the columns 
database_region_counts.columns = ['africa_1','africa_2',
                                     'asia_1','asia_2',
                                     'aus_1','aus_2',
                                     'ee_1','ee_2',
                                     'la_1','la_2',
                                     'me_1','me_2',
                                     'na_1','na_2',
                                     'sa_1','sa_2',
                                     'we_1','we_2']
database_region_counts.head()

In [ ]:
# perctange of databases used per region
total_per_database_af = ((database_region_counts['africa_2']/(database_region_counts['africa_1']
                                                               +database_region_counts['africa_2']))*100).round(2)
total_per_database_af.head()

In [ ]:
# remaining percantages for the other regions
total_per_database_asia = ((database_region_counts['asia_2']/(database_region_counts['asia_1']
                                                               +database_region_counts['asia_2']))*100).round(2)

total_per_database_aus = ((database_region_counts['aus_2']/(database_region_counts['aus_1']
                                                               +database_region_counts['aus_2']))*100).round(2)

total_per_database_ee = ((database_region_counts['ee_2']/(database_region_counts['ee_1']
                                                               +database_region_counts['ee_2']))*100).round(2)

total_per_database_la = ((database_region_counts['la_2']/(database_region_counts['la_1']
                                                               +database_region_counts['la_2']))*100).round(2)

total_per_database_me = ((database_region_counts['me_2']/(database_region_counts['me_1']
                                                               +database_region_counts['me_2']))*100).round(2)

total_per_database_na = ((database_region_counts['na_2']/(database_region_counts['na_1']
                                                               +database_region_counts['na_2']))*100).round(2)

total_per_database_sa = ((database_region_counts['sa_2']/(database_region_counts['sa_1']
                                                               +database_region_counts['sa_2']))*100).round(2)

total_per_database_we = ((database_region_counts['we_2']/(database_region_counts['we_1']
                                                               +database_region_counts['we_2']))*100).round(2)

In [ ]:
# making a df for the percentages of tools used 
region_database_perc = pd.concat([
total_per_database_af,
total_per_database_asia,
    total_per_database_aus,
    total_per_database_ee,
    total_per_database_la,
    total_per_database_me,
    total_per_database_na,
    total_per_database_sa,
    total_per_database_we,
    
], axis= 1)
region_database_perc.head()

In [ ]:
# renaming the columns above 
region_database_perc = region_database_perc.set_axis(['africa', 'asia', 'aus', 'ee', 'la', 'me', 'na', 'sa', 'we'], axis='columns', inplace=False)
region_database_perc